src/lib/tin.xml

<soap:Envelope
    xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:tns1="urn:ec.europa.eu:taxud:tin:services:checkTin:types"
    xmlns:impl="urn:ec.europa.eu:taxud:tin:services:checkTin">
    <soap:Header> </soap:Header>
    <soap:Body>
        <tns1:checkTin
            xmlns:tns1="urn:ec.europa.eu:taxud:tin:services:checkTin:types"
            xmlns="urn:ec.europa.eu:taxud:tin:services:checkTin:types">
            <tns1:countryCode>_country_code_placeholder_</tns1:countryCode>
            <tns1:tinNumber>_tin_number_placeholder_</tns1:tinNumber>
        </tns1:checkTin>
    </soap:Body>
</soap:Envelope>
